program DiagonalAverage;

const
  N = 5; { Розмірність масиву (можна змінювати за потреби) }

var
  matrix: array[1..N, 1..N] of Integer; { Оголошуємо двовимірний масив для зберігання елементів матриці }
  i, j, sum: Integer; { Змінні для ітерацій та обчислення суми елементів діагоналі }
  average: Real; { Змінна для збереження середнього арифметичного }

begin
  { Генерація елементів матриці в діапазоні від -100 до 100 }
  writeln('Згенеровані елементи матриці:');
  Randomize; { Ініціалізуємо генератор випадкових чисел }
  for i := 1 to N do
    for j := 1 to N do
    begin
      matrix[i, j] := Random(201) - 100; { Генеруємо випадкове число в діапазоні від -100 до 100 }
      write(matrix[i, j]:4); { Виводимо згенерований елемент на екран }
    end;
  writeln;

  { Обчислення суми елементів на головній діагоналі }
  sum := 0; { Ініціалізуємо змінну суми }
  for i := 1 to N do
  begin
    sum := sum + matrix[i, i]; { Додаємо до суми елементи, що знаходяться на головній діагоналі }
  end;

  { Обчислення середнього арифметичного }
  average := sum / N; { Ділимо суму елементів головної діагоналі на кількість елементів для знаходження середнього арифметичного }

  { Виведення результату }
  writeln('Середнє арифметичне елементів на головній діагоналі: ', average:0:2); 
  { Виводимо результат з точністю до двох знаків після коми }
end.

